en/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-20 Fri 21:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Richard Davis, Composer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Richard Davis" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Richard Davis, Composer
<br />
<span class="subtitle">Home</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga40dd63">About</a></li>
<li><a href="#orgbd95f23">Links</a>
<ul>
<li><a href="#orgc931945">Listening</a></li>
<li><a href="#org56ffced">Miscellaneous</a></li>
</ul>
</li>
<li><a href="#org0ee998a">Contact</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Home</a></td>
<td class="org-left"><a href="./events.html">Events</a></td>
<td class="org-left"><a href="./press.html">Press</a></td>
<td class="org-left"><a href="./listening.html">Listening</a></td>
<td class="org-left"><a href="../fr/index.html">FR</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-orga40dd63" class="outline-2">
<h2 id="orga40dd63">About</h2>
<div class="outline-text-2" id="text-orga40dd63">
<p>
Salutations!
My name is Richard Davis.
I am a Montreal- and Massachusetts-based composer, viola performer, and teacher.
My primary compositional interests are intertextuality, live electronics, vocal or vocal-emulating music, and computer-assisted composition.
With viola, I specialize in contemporary music performance.
</p>
</div>
</div>

<div id="outline-container-orgbd95f23" class="outline-2">
<h2 id="orgbd95f23">Links</h2>
<div class="outline-text-2" id="text-orgbd95f23">
</div>
<div id="outline-container-orgc931945" class="outline-3">
<h3 id="orgc931945">Listening</h3>
<div class="outline-text-3" id="text-orgc931945">
<ul class="org-ul">
<li><a href="https://youtube.com/@davisrichard437">YouTube Channel</a></li>
<li><a href="https://soundcloud.com/richard-davis-333277866">SoundCloud</a></li>
</ul>
</div>
</div>

<div id="outline-container-org56ffced" class="outline-3">
<h3 id="org56ffced">Miscellaneous</h3>
<div class="outline-text-3" id="text-org56ffced">
<p>
Some might be interested in my <a href="https://gitlab.com/davisrichard437">GitLab</a>, which has a number of Python scripts I've written in the past for various computer-assisted composition tasks.
I also have a <a href="https://github.com/davisrichard437">GitHub</a>, but this is secondary and primarily for collaboration with others.
</p>
</div>
</div>
</div>

<div id="outline-container-org0ee998a" class="outline-2">
<h2 id="org0ee998a">Contact</h2>
<div class="outline-text-2" id="text-org0ee998a">
<p>
Send me an email at <a href="mailto:davisrichard437@gmail.com">davisrichard437@gmail.com</a>!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Richard Davis</p>
<p class="date">Created: 2023-01-20 Fri 21:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
